gugugu531/MSPM0_Car/board/sys_config/ti_msp_dl_config.h
/* Defines for MPU6050_JY61P_Tracking */
#define MPU6050_JY61P_Tracking_INST                                         I2C0
#define MPU6050_JY61P_Tracking_INST_IRQHandler                         I2C0_IRQHandler
#define MPU6050_JY61P_Tracking_INST_INT_IRQN                           I2C0_INT_IRQn
#define MPU6050_JY61P_Tracking_BUS_SPEED_HZ                                  400000
#define GPIO_MPU6050_JY61P_Tracking_SDA_PORT                                   GPIOA
#define GPIO_MPU6050_JY61P_Tracking_SDA_PIN                           DL_GPIO_PIN_0
#define GPIO_MPU6050_JY61P_Tracking_IOMUX_SDA                          (IOMUX_PINCM1)
#define GPIO_MPU6050_JY61P_Tracking_IOMUX_SDA_FUNC                IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_MPU6050_JY61P_Tracking_SCL_PORT                                   GPIOA
#define GPIO_MPU6050_JY61P_Tracking_SCL_PIN                           DL_GPIO_PIN_1
#define GPIO_MPU6050_JY61P_Tracking_IOMUX_SCL                          (IOMUX_PINCM2)
#define GPIO_MPU6050_JY61P_Tracking_IOMUX_SCL_FUNC                IOMUX_PINCM2_PF_I2C0_SCL


/* Defines for BlueTooth */
#define BlueTooth_INST                                                     UART0
#define BlueTooth_INST_FREQUENCY                                        32000000
#define BlueTooth_INST_IRQHandler                               UART0_IRQHandler
#define BlueTooth_INST_INT_IRQN                                   UART0_INT_IRQn
#define GPIO_BlueTooth_RX_PORT                                             GPIOB
#define GPIO_BlueTooth_TX_PORT                                             GPIOB
#define GPIO_BlueTooth_RX_PIN                                      DL_GPIO_PIN_1
#define GPIO_BlueTooth_TX_PIN                                      DL_GPIO_PIN_0
#define GPIO_BlueTooth_IOMUX_RX                                  (IOMUX_PINCM13)
#define GPIO_BlueTooth_IOMUX_TX                                  (IOMUX_PINCM12)
#define GPIO_BlueTooth_IOMUX_RX_FUNC                   IOMUX_PINCM13_PF_UART0_RX
#define GPIO_BlueTooth_IOMUX_TX_FUNC                   IOMUX_PINCM12_PF_UART0_TX
#define BlueTooth_BAUD_RATE                                             (115200)
#define BlueTooth_IBRD_32_MHZ_115200_BAUD                                   (17)
#define BlueTooth_FBRD_32_MHZ_115200_BAUD                                   (23)
/* Defines for K230 */
#define K230_INST                                                          UART2
#define K230_INST_FREQUENCY                                             32000000
#define K230_INST_IRQHandler                                    UART2_IRQHandler
#define K230_INST_INT_IRQN                                        UART2_INT_IRQn
#define GPIO_K230_RX_PORT                                                  GPIOA
#define GPIO_K230_TX_PORT                                                  GPIOA
#define GPIO_K230_RX_PIN                                          DL_GPIO_PIN_24
#define GPIO_K230_TX_PIN                                          DL_GPIO_PIN_23
#define GPIO_K230_IOMUX_RX                                       (IOMUX_PINCM54)
#define GPIO_K230_IOMUX_TX                                       (IOMUX_PINCM53)
#define GPIO_K230_IOMUX_RX_FUNC                        IOMUX_PINCM54_PF_UART2_RX
#define GPIO_K230_IOMUX_TX_FUNC                        IOMUX_PINCM53_PF_UART2_TX
#define K230_BAUD_RATE                                                  (115200)
#define K230_IBRD_32_MHZ_115200_BAUD                                        (17)
#define K230_FBRD_32_MHZ_115200_BAUD                                        (23)
/* Defines for BLDC */
#define BLDC_INST                                                          UART3
#define BLDC_INST_FREQUENCY                                             32000000
#define BLDC_INST_IRQHandler                                    UART3_IRQHandler
#define BLDC_INST_INT_IRQN                                        UART3_INT_IRQn
#define GPIO_BLDC_RX_PORT                                                  GPIOB
#define GPIO_BLDC_TX_PORT                                                  GPIOB
#define GPIO_BLDC_RX_PIN                                           DL_GPIO_PIN_3
#define GPIO_BLDC_TX_PIN                                          DL_GPIO_PIN_12
#define GPIO_BLDC_IOMUX_RX                                       (IOMUX_PINCM16)
#define GPIO_BLDC_IOMUX_TX                                       (IOMUX_PINCM29)
#define GPIO_BLDC_IOMUX_RX_FUNC                        IOMUX_PINCM16_PF_UART3_RX
#define GPIO_BLDC_IOMUX_TX_FUNC                        IOMUX_PINCM29_PF_UART3_TX
#define BLDC_BAUD_RATE                                                  (115200)
#define BLDC_IBRD_32_MHZ_115200_BAUD                                        (17)
#define BLDC_FBRD_32_MHZ_115200_BAUD                                        (23)
/* Defines for Debug_Ex */
#define Debug_Ex_INST                                                      UART1
#define Debug_Ex_INST_FREQUENCY                                         32000000
#define Debug_Ex_INST_IRQHandler                                UART1_IRQHandler
#define Debug_Ex_INST_INT_IRQN                                    UART1_INT_IRQn
#define GPIO_Debug_Ex_RX_PORT                                              GPIOA
#define GPIO_Debug_Ex_TX_PORT                                              GPIOA
#define GPIO_Debug_Ex_RX_PIN                                       DL_GPIO_PIN_9
#define GPIO_Debug_Ex_TX_PIN                                       DL_GPIO_PIN_8
#define GPIO_Debug_Ex_IOMUX_RX                                   (IOMUX_PINCM20)
#define GPIO_Debug_Ex_IOMUX_TX                                   (IOMUX_PINCM19)
#define GPIO_Debug_Ex_IOMUX_RX_FUNC                    IOMUX_PINCM20_PF_UART1_RX
#define GPIO_Debug_Ex_IOMUX_TX_FUNC                    IOMUX_PINCM19_PF_UART1_TX
#define Debug_Ex_BAUD_RATE                                              (115200)
#define Debug_Ex_IBRD_32_MHZ_115200_BAUD                                    (17)
#define Debug_Ex_FBRD_32_MHZ_115200_BAUD                                    (23)





/* Port definition for Pin Group Servo */
#define Servo_PORT                                                       (GPIOA)

/* Defines for PIN1: GPIOA.28 with pinCMx 3 on package pin 35 */
#define Servo_PIN1_PIN                                          (DL_GPIO_PIN_28)
#define Servo_PIN1_IOMUX                                          (IOMUX_PINCM3)
/* Port definition for Pin Group Buzzer */
#define Buzzer_PORT                                                      (GPIOB)

