gugugu531/MSPM0_Car/board/sys_config/ti_msp_dl_config.h
/* Defines for PIN: GPIOB.5 with pinCMx 18 on package pin 53 */
#define Buzzer_PIN_PIN                                           (DL_GPIO_PIN_5)
#define Buzzer_PIN_IOMUX                                         (IOMUX_PINCM18)
/* Port definition for Pin Group BlueTooth_State */
#define BlueTooth_State_PORT                                             (GPIOB)

/* Defines for State_PIN: GPIOB.10 with pinCMx 27 on package pin 62 */
#define BlueTooth_State_State_PIN_PIN                           (DL_GPIO_PIN_10)
#define BlueTooth_State_State_PIN_IOMUX                          (IOMUX_PINCM27)
/* Defines for DIR1: GPIOB.14 with pinCMx 31 on package pin 2 */
#define SMotor_IO_DIR1_PORT                                              (GPIOB)
#define SMotor_IO_DIR1_PIN                                      (DL_GPIO_PIN_14)
#define SMotor_IO_DIR1_IOMUX                                     (IOMUX_PINCM31)
/* Defines for DIR2: GPIOA.15 with pinCMx 37 on package pin 8 */
#define SMotor_IO_DIR2_PORT                                              (GPIOA)
#define SMotor_IO_DIR2_PIN                                      (DL_GPIO_PIN_15)
#define SMotor_IO_DIR2_IOMUX                                     (IOMUX_PINCM37)
/* Defines for EN1: GPIOB.11 with pinCMx 28 on package pin 63 */
#define SMotor_IO_EN1_PORT                                               (GPIOB)
#define SMotor_IO_EN1_PIN                                       (DL_GPIO_PIN_11)
#define SMotor_IO_EN1_IOMUX                                      (IOMUX_PINCM28)
/* Defines for EN2: GPIOB.20 with pinCMx 48 on package pin 19 */
#define SMotor_IO_EN2_PORT                                               (GPIOB)
#define SMotor_IO_EN2_PIN                                       (DL_GPIO_PIN_20)
#define SMotor_IO_EN2_IOMUX                                      (IOMUX_PINCM48)
/* Defines for AIN1: GPIOA.16 with pinCMx 38 on package pin 9 */
#define Motor_IO_AIN1_PORT                                               (GPIOA)
#define Motor_IO_AIN1_PIN                                       (DL_GPIO_PIN_16)
#define Motor_IO_AIN1_IOMUX                                      (IOMUX_PINCM38)
/* Defines for AIN2: GPIOB.17 with pinCMx 43 on package pin 14 */
#define Motor_IO_AIN2_PORT                                               (GPIOB)
#define Motor_IO_AIN2_PIN                                       (DL_GPIO_PIN_17)
#define Motor_IO_AIN2_IOMUX                                      (IOMUX_PINCM43)
/* Defines for BIN1: GPIOB.18 with pinCMx 44 on package pin 15 */
#define Motor_IO_BIN1_PORT                                               (GPIOB)
#define Motor_IO_BIN1_PIN                                       (DL_GPIO_PIN_18)
#define Motor_IO_BIN1_IOMUX                                      (IOMUX_PINCM44)
/* Defines for BIN2: GPIOB.19 with pinCMx 45 on package pin 16 */
#define Motor_IO_BIN2_PORT                                               (GPIOB)
#define Motor_IO_BIN2_PIN                                       (DL_GPIO_PIN_19)
#define Motor_IO_BIN2_IOMUX                                      (IOMUX_PINCM45)
/* Defines for E1A: GPIOB.2 with pinCMx 15 on package pin 50 */
#define Motor_IO_E1A_PORT                                                (GPIOB)
// pins affected by this interrupt request:["E1A"]
#define Motor_IO_GPIOB_INT_IRQN                                 (GPIOB_INT_IRQn)
#define Motor_IO_GPIOB_INT_IIDX                 (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define Motor_IO_E1A_IIDX                                    (DL_GPIO_IIDX_DIO2)
#define Motor_IO_E1A_PIN                                         (DL_GPIO_PIN_2)
#define Motor_IO_E1A_IOMUX                                       (IOMUX_PINCM15)
/* Defines for E2A: GPIOA.22 with pinCMx 47 on package pin 18 */
#define Motor_IO_E2A_PORT                                                (GPIOA)
// pins affected by this interrupt request:["E2A"]
#define Motor_IO_GPIOA_INT_IRQN                                 (GPIOA_INT_IRQn)
#define Motor_IO_GPIOA_INT_IIDX                 (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define Motor_IO_E2A_IIDX                                   (DL_GPIO_IIDX_DIO22)
#define Motor_IO_E2A_PIN                                        (DL_GPIO_PIN_22)
#define Motor_IO_E2A_IOMUX                                       (IOMUX_PINCM47)
/* Defines for E1B: GPIOA.2 with pinCMx 7 on package pin 42 */
#define Motor_IO_E1B_PORT                                                (GPIOA)
#define Motor_IO_E1B_PIN                                         (DL_GPIO_PIN_2)
#define Motor_IO_E1B_IOMUX                                        (IOMUX_PINCM7)
/* Defines for E2B: GPIOA.25 with pinCMx 55 on package pin 26 */
#define Motor_IO_E2B_PORT                                                (GPIOA)
#define Motor_IO_E2B_PIN                                        (DL_GPIO_PIN_25)
#define Motor_IO_E2B_IOMUX                                       (IOMUX_PINCM55)
/* Defines for PIN_1: GPIOA.14 with pinCMx 36 on package pin 7 */
#define Key_PIN_1_PORT                                                   (GPIOA)
#define Key_PIN_1_PIN                                           (DL_GPIO_PIN_14)
#define Key_PIN_1_IOMUX                                          (IOMUX_PINCM36)
/* Defines for PIN_2: GPIOB.22 with pinCMx 50 on package pin 21 */
#define Key_PIN_2_PORT                                                   (GPIOB)
#define Key_PIN_2_PIN                                           (DL_GPIO_PIN_22)
#define Key_PIN_2_IOMUX                                          (IOMUX_PINCM50)
/* Defines for PIN_3: GPIOB.24 with pinCMx 52 on package pin 23 */
#define Key_PIN_3_PORT                                                   (GPIOB)
#define Key_PIN_3_PIN                                           (DL_GPIO_PIN_24)
#define Key_PIN_3_IOMUX                                          (IOMUX_PINCM52)
/* Defines for PIN_4: GPIOB.25 with pinCMx 56 on package pin 27 */
#define Key_PIN_4_PORT                                                   (GPIOB)
#define Key_PIN_4_PIN                                           (DL_GPIO_PIN_25)
#define Key_PIN_4_IOMUX                                          (IOMUX_PINCM56)
/* Defines for Tracking_1: GPIOB.6 with pinCMx 23 on package pin 58 */
#define Tracking_Tracking_1_PORT                                         (GPIOB)
#define Tracking_Tracking_1_PIN                                  (DL_GPIO_PIN_6)
#define Tracking_Tracking_1_IOMUX                                (IOMUX_PINCM23)
/* Defines for Tracking_2: GPIOB.7 with pinCMx 24 on package pin 59 */
#define Tracking_Tracking_2_PORT                                         (GPIOB)
#define Tracking_Tracking_2_PIN                                  (DL_GPIO_PIN_7)
#define Tracking_Tracking_2_IOMUX                                (IOMUX_PINCM24)
/* Defines for Tracking_3: GPIOB.8 with pinCMx 25 on package pin 60 */
#define Tracking_Tracking_3_PORT                                         (GPIOB)
#define Tracking_Tracking_3_PIN                                  (DL_GPIO_PIN_8)
#define Tracking_Tracking_3_IOMUX                                (IOMUX_PINCM25)
/* Defines for Tracking_4: GPIOB.9 with pinCMx 26 on package pin 61 */
#define Tracking_Tracking_4_PORT                                         (GPIOB)
#define Tracking_Tracking_4_PIN                                  (DL_GPIO_PIN_9)
#define Tracking_Tracking_4_IOMUX                                (IOMUX_PINCM26)
/* Defines for Tracking_5: GPIOA.12 with pinCMx 34 on package pin 5 */
#define Tracking_Tracking_5_PORT                                         (GPIOA)
#define Tracking_Tracking_5_PIN                                 (DL_GPIO_PIN_12)
#define Tracking_Tracking_5_IOMUX                                (IOMUX_PINCM34)
/* Defines for Tracking_6: GPIOB.26 with pinCMx 57 on package pin 28 */
#define Tracking_Tracking_6_PORT                                         (GPIOB)
#define Tracking_Tracking_6_PIN                                 (DL_GPIO_PIN_26)
#define Tracking_Tracking_6_IOMUX                                (IOMUX_PINCM57)
/* Defines for Tracking_7: GPIOB.23 with pinCMx 51 on package pin 22 */
#define Tracking_Tracking_7_PORT                                         (GPIOB)
#define Tracking_Tracking_7_PIN                                 (DL_GPIO_PIN_23)
#define Tracking_Tracking_7_IOMUX                                (IOMUX_PINCM51)
/* Defines for Tracking_8: GPIOA.13 with pinCMx 35 on package pin 6 */
#define Tracking_Tracking_8_PORT                                         (GPIOA)
#define Tracking_Tracking_8_PIN                                 (DL_GPIO_PIN_13)
#define Tracking_Tracking_8_IOMUX                                (IOMUX_PINCM35)
/* Port definition for Pin Group SR04 */
#define SR04_PORT                                                        (GPIOA)

/* Defines for Trig: GPIOA.27 with pinCMx 60 on package pin 31 */
#define SR04_Trig_PIN                                           (DL_GPIO_PIN_27)
#define SR04_Trig_IOMUX                                          (IOMUX_PINCM60)
/* Defines for Echo: GPIOA.26 with pinCMx 59 on package pin 30 */
#define SR04_Echo_PIN                                           (DL_GPIO_PIN_26)
#define SR04_Echo_IOMUX                                          (IOMUX_PINCM59)
/* Defines for G: GPIOA.31 with pinCMx 6 on package pin 39 */
#define LED_G_PORT                                                       (GPIOA)
#define LED_G_PIN                                               (DL_GPIO_PIN_31)
#define LED_G_IOMUX                                               (IOMUX_PINCM6)
/* Defines for Y: GPIOB.27 with pinCMx 58 on package pin 29 */
#define LED_Y_PORT                                                       (GPIOB)
#define LED_Y_PIN                                               (DL_GPIO_PIN_27)
#define LED_Y_IOMUX                                              (IOMUX_PINCM58)
/* Defines for R: GPIOB.16 with pinCMx 33 on package pin 4 */
#define LED_R_PORT                                                       (GPIOB)
#define LED_R_PIN                                               (DL_GPIO_PIN_16)
#define LED_R_IOMUX                                              (IOMUX_PINCM33)




/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_Motor_init(void);
void SYSCFG_DL_SMotor_1_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_OLED_init(void);
void SYSCFG_DL_MPU6050_JY61P_Tracking_init(void);
void SYSCFG_DL_BlueTooth_init(void);
void SYSCFG_DL_K230_init(void);
void SYSCFG_DL_BLDC_init(void);
void SYSCFG_DL_Debug_Ex_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
